---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.MoreThanOneAxis
source: html/3bcbd93e-b382-4465-5a38-71167d93143e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.MoreThanOneAxis Property

More than one axes of revolution.

## Syntax (C#)
```csharp
public static FailureDefinitionId MoreThanOneAxis { get; }
```